results/results_r5_large/results_r5_large_run2/oltp_read_only_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 37.39 qps: 603.99 (r/w/o: 528.40/0.00/75.59) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 38.50 qps: 616.22 (r/w/o: 539.22/0.00/77.00) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 36.40 qps: 582.50 (r/w/o: 509.70/0.00/72.80) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 47.80 qps: 763.40 (r/w/o: 667.90/0.00/95.50) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 41.20 qps: 660.00 (r/w/o: 577.60/0.00/82.40) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 36.70 qps: 587.20 (r/w/o: 513.70/0.00/73.50) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 42.00 qps: 672.00 (r/w/o: 588.00/0.00/84.00) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 35.90 qps: 575.70 (r/w/o: 503.90/0.00/71.80) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 40.60 qps: 647.70 (r/w/o: 566.50/0.00/81.20) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 55.10 qps: 884.20 (r/w/o: 774.00/0.00/110.20) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 34.80 qps: 554.90 (r/w/o: 485.30/0.00/69.60) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 41.20 qps: 658.50 (r/w/o: 576.10/0.00/82.40) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            68376
        write:                           0
        other:                           9768
        total:                           78144
    transactions:                        4884   (40.67 per sec.)
    queries:                             78144  (650.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      40.6699
    time elapsed:                        120.0887s
    total number of events:              4884

Latency (ms):
         min:                                   23.83
         avg:                                  196.66
         max:                                  932.48
         95th percentile:                      520.62
         sum:                               960495.15

Threads fairness:
    events (avg/stddev):           610.5000/7.18
    execution time (avg/stddev):   120.0619/0.02